Tekla Open API Reference for Tekla Structures 2025
LinkAttributes Methods
The LinkAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the link frame attributes from the specified file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
LinkAttributes Class
Tekla.Structures.Drawing Namespace